#!/usr/bin/env python
# encoding: utf-8


__all__ = [

    # @sp开头 采用selenium模拟浏览器
    # @sl开头 采用urllib(2)直接访问

    # ------------------aizhan------------------
    # 获取ip或域名相关网站
    'spaizhan',
    # ------------------------------------------

    # ------------------baidu-------------------
    # key=ip 获取ip相关网站，并检测是否绑定
    # key=domain 获取相关子域名
    'spbaidu',
    # ------------------------------------------

    # ------------------bing--------------------
    # key=ip 获取ip相关网站，并检测是否绑定
    # key=domain 获取相关子域名
    'spbing',
    # ------------------------------------------
    #
    #               其它查询相关子域名
    #
    'spsubdomain',
    # or
    'slsubdomain',
]
